Documents/СчетНаОплату.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>СчетНаОплату</Name>
			<BasedOn>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мастер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТабНоменклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаборСвойств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/СчетНаОплату/Ext/ManagerModule.bsl
Процедура СчетНаОплату(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(СчетНаОплату)
	Макет = Документы.СчетНаОплату.ПолучитьМакет("СчетНаОплату");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СчетНаОплату.Дата,
	|	СчетНаОплату.Договор,
	|	СчетНаОплату.Комментарий,
	|	СчетНаОплату.Контрагент,
	|	СчетНаОплату.Мастер,
	|	СчетНаОплату.Номер,
	|	СчетНаОплату.СуммаДокумента,
	|	СчетНаОплату.ТабНоменклатура.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Количество,
	|		Цена,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.СчетНаОплату КАК СчетНаОплату
	|ГДЕ
	|	СчетНаОплату.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТабНоменклатураШапка = Макет.ПолучитьОбласть("ТабНоменклатураШапка");
	ОбластьТабНоменклатура = Макет.ПолучитьОбласть("ТабНоменклатура");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТабНоменклатураШапка);
		ВыборкаТабНоменклатура = Выборка.ТабНоменклатура.Выбрать();
		Пока ВыборкаТабНоменклатура.Следующий() Цикл
			ОбластьТабНоменклатура.Параметры.Заполнить(ВыборкаТабНоменклатура);
			ТабДок.Вывести(ОбластьТабНоменклатура, ВыборкаТабНоменклатура.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры

Процедура СчетНаОплатуРасширенный(ТабДок, Ссылка) Экспорт
	
	Макет = Документы.СчетНаОплату.ПолучитьМакет("СчетНаОплатуРасширенный");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СчетНаОплату.Дата,
	|	СчетНаОплату.Договор,
	|	СчетНаОплату.Комментарий,
	|	СчетНаОплату.Контрагент,
	|	СчетНаОплату.Мастер,
	|	СчетНаОплату.Номер,
	|	СчетНаОплату.СуммаДокумента,
	|	СчетНаОплату.ТабНоменклатура.(
	|		НомерСтроки,
	|		Номенклатура,
	|		ЕдиницаИзмерения,
	|		ВидНоменклатуры,
	|		Количество,
	|		Цена,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.СчетНаОплату КАК СчетНаОплату
	|ГДЕ
	|	СчетНаОплату.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	
	//Область объявления областей макета для дальнейшего заполнения и вывода
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТабНоменклатураШапка = Макет.ПолучитьОбласть("ТабНоменклатураШапка");
	ОбластьТабНоменклатура = Макет.ПолучитьОбласть("ТабНоменклатура");
	Подвал = Макет.ПолучитьОбласть("Подвал"); 
	
	//Объявляем добавленные нами области
	ОбластьСуммаПрописью = Макет.ПолучитьОбласть("СуммаПрописью"); 
	Подписи = Макет.ПолучитьОбласть("Подписи"); 
	ОбластьКомментарий = Макет.ПолучитьОбласть("Комментарий");
	
	//-------------------------------------------------------------------------------	
	

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		//Заполняем параметры области - ОбластьЗаголовок
		ОбластьЗаголовок.Параметры.Банк = Константы.Банк.Получить();
		ОбластьЗаголовок.Параметры.БИК =  Константы.Банк.Получить().БИК;
		ОбластьЗаголовок.Параметры.КоррСчет = Константы.ОргКоррСчет.Получить();
		ОбластьЗаголовок.Параметры.РСч = Константы.ОргРасчетныйСчет.Получить();
		ОбластьЗаголовок.Параметры.ИНН = Константы.ОргИНН.Получить();
		ОбластьЗаголовок.Параметры.КПП = Константы.ОргКПП.Получить();
		ОбластьЗаголовок.Параметры.НазваниеФирмы = Константы.ОргНаименование.Получить(); 
				
		ТабДок.Вывести(ОбластьЗаголовок);
		
		
		//-------------------------------------------------------------------------------
		
		
		//Заполняем параметры области - Шапка
		Шапка.Параметры.Заполнить(Выборка);
		
		
		//Дозаполняем параметры в области Шапка
		Шапка.Параметры.Организация = Константы.ОргНаименование.Получить();
		Шапка.Параметры.ИНН = Константы.ОргИНН.Получить();
		Шапка.Параметры.КПП = Константы.ОргКПП.Получить();
		Шапка.Параметры.Адрес = Константы.ОргПочтовыйАдрес.Получить();
		
		Шапка.Параметры.Номер = Число(Выборка.Номер);
		Шапка.Параметры.Дата = Формат(Выборка.Дата,"ДЛФ=DD");
		
		Шапка.Параметры.Контрагент = Выборка.Контрагент.ПолноеНаименование;
		Шапка.Параметры.КонтрагентИНН = Выборка.Контрагент.ИНН;
						
		ТабДок.Вывести(Шапка, Выборка.Уровень());
		
		//-------------------------------------------------------------------------------
		
		
		//Заполняем параметры области - Шапка
		
		ТабДок.Вывести(ОбластьТабНоменклатураШапка);
		ВыборкаТабНоменклатура = Выборка.ТабНоменклатура.Выбрать();
		Пока ВыборкаТабНоменклатура.Следующий() Цикл
			ОбластьТабНоменклатура.Параметры.Заполнить(ВыборкаТабНоменклатура);
			ТабДок.Вывести(ОбластьТабНоменклатура, ВыборкаТабНоменклатура.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал); 
		
		//-------------------------------------------------------------------------------
		
		
		//Заполняем параметры области - СуммаПрописью
		ОбластьСуммаПрописью.Параметры.Заполнить(Выборка);
		ОбластьСуммаПрописью.Параметры.ЧислоНаименований = ВыборкаТабНоменклатура.Количество();
		
		ОбластьСуммаПрописью.Параметры.ИтогоПрописью = 
		РаботаСДокументами.ИтоговоеЧислоПрописью(Выборка.СуммаДокумента);
		
		ТабДок.Вывести(ОбластьСуммаПрописью);
		
		//------------------------------------------------------------------------------
		
		
		//Заполняем параметры области - Подписи
		Подписи.Параметры.РуководительДолжность = Константы.ОргРуководительДолжность.Получить();
		Подписи.Параметры.Руководитель = РаботаСоСправочниками.СформироватьСокращенноеФИОИзСтроки(Константы.ОргРуководительФИО.Получить());
		
		Подписи.Параметры.БухгалтерДолжность = Константы.ДолжностьБухгалтера.Получить();
		Подписи.Параметры.Бухгалтер = РаботаСоСправочниками.СформироватьСокращенноеФИОИзСтроки(Константы.Бухгалтер.Получить());
		
        ТабДок.Вывести(Подписи);
		
		
		//------------------------------------------------------------------------------
		
		//Заполняем параметры области - ОбластьКомментарий
		
		//Вариант 1
		//ОбластьКомментарий.Параметры.Мастер = Выборка.Мастер;
		//ОбластьКомментарий.Параметры.Комментарий = Выборка.Комментарий;
		
		//Вариант 2
		//ОбластьКомментарий.Параметры.Заполнить(Выборка);
		
		//---------------------------------------------
		
		
		Если НЕ ПустаяСтрока(Выборка.Комментарий) Тогда
			ОбластьКомментарий.Параметры.Заполнить(Выборка);
		    ТабДок.Вывести(ОбластьКомментарий);
		КонецЕсли;
		
		ВставлятьРазделительСтраниц = Истина; 
		
	КонецЦикла;

КонецПроцедуры
